In [1]:
import pandas as pd 
from sqlalchemy import create_engine

In [18]:
income_df = pd.read_csv('Data sources/Personal Income by county.csv')
income_df.rename(columns={'ID': 'id', "State" :'state', "County" :'county', 
                          "Year" :'year', "Per_Capita_Income" :'per_capita_income',
                        "Percent_Change_YOY" :'percent_change_yoy' }, inplace=True)
income_df.set_index('id', inplace = True)
income_df

     state    county  year  per_capita_income  percent_change_yoy
id
1    Texas  Anderson  2017              32759                 NaN
2    Texas   Andrews  2017              45435                 NaN
3    Texas  Angelina  2017              37347                 NaN
4    Texas   Aransas  2017              45597                 NaN
5    Texas    Archer  2017              47778                 NaN
..     ...       ...   ...                ...                 ...
758  Texas      Wood  2019              39803                 3.7
759  Texas    Yoakum  2019              44932                 5.2
760  Texas     Young  2019              50732                 1.4
761  Texas    Zapata  2019              28936                 1.3
762  Texas    Zavala  2019              30779                 6.2

[762 rows x 5 columns]

In [3]:
rds_connection_string = f"postgres:{password_here}@localhost:5432/Non_profit"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [4]:
engine.table_names()

['house_median_prices', 'income']

In [19]:
income_df.to_sql(name='income', con=engine, if_exists='append',index=True)